app/Http/Controllers/ChatController.php

select * from `chats`
select * from `rooms` inner join `categories` on `rooms`.`category_id` = `c_id` inner join `titles` on `rooms`.`title_id` = `t_id` where `r_id` = '19' limit 1
---
    public function index($roomid,$state){

        $chats= Chat::get();
        $debater = new Debater();
        $bystander= new Bystander();
        $user=Auth::user();
        $name = $user['name'];
        $userid= $user['id'];

        //傍観者で選択した場合と発表者で選択された場合の処理
        if($state == 0) {
            $debater->insert($roomid,$userid);
        }else{
            $bystander->insert($roomid, $userid);
        }

        //1ルームの情報全てを持ってくる
        $roomdata = DB::table('rooms')
            ->join('categories','rooms.category_id','=','c_id')
            ->join('titles','rooms.title_id','=','t_id')

            ->where('r_id','=',$roomid)->first();

insert into `chats` (`user_id`, `user_name`, `room_id`, `message`, `updated_at`, `created_at`) values ('1', 'hogehoge', '19', 'bx', '2022-07-06 01:40:15', '2022-07-06 01:40:15')
---
    public function store(Request $request,$roomid,){
        $chats=new Chat;
        //チャットの内容を全て保存
        $chats->fill($request->all())->save();