app/Http/Controllers/genreController.php

select * from `titles`
---
    public function index(){
        $title = Title::all();