app/Http/Controllers/GenreController.php

select * from `categories`
---
    public function index(){
        $cate = Category::all();