app/Models/Debater.php

    public function insert($room_id,$user_id){
        //賛成か反対かのフラグを生成
        //0が賛成1が反対
        $flag=random_int(0,1);

        //値が含まれていない場合
        //ディベーターテーブルのroomidと引数のroomidが同じものが入っていない
        //そしてd_pdの値も入っていない場合の値を取得する
        if(Debater::select()->join('rooms','r_id','=','debaters.room_id')->where('debaters.room_id','=',$room_id)->doesntExist()->where('d_pd')->doesntExist()->get()){
            $insert = Debater::create([
                'user_id'=>$user_id,
                'room_id'=>$room_id,
                'd_pd'=>$flag
            ]);
        }
        //0の値が含まれている場合(賛成)
        //roomidも同じカラムが1件登録されていた場合
        else if(Debater::where('d_pd','=','0')->where('debaters.room_id','=',$room_id)->get()==1){
            $insert = Debater::create([
                'user_id'=>$user_id,
                'room_id'=>$room_id,
                'd_pd'=>1
            ]);
---
insert into `debaters` (`user_id`, `room_id`, `d_pd`) values (1, '19', 1)